# --- Заголовок ------------------------------------

title = "КРУТОЕ ПРИКЛЮЧЕНИЕ"
frame = "=" * 20

print(frame)
print(" " + title + " ")
print(frame)

print()

# --- Знакомство с героем --------------------------
print("Как зовут героя?")
hero_name = input()

print(f"Добро пожаловать, {hero_name}!")
print("Ты появляешься на пустом поле.")

print()
# --- Меню действий ---------------------------------
print("Что делаешь?")

print("1 - осмотреться")
print("2 - идти вперёд")
print("3 - отдохнуть")
print("4 - копать")
print("5 - отжаться")

print()
# --- Выбор героя -----------------------------------

choice = input()
print()

# --- Прощание ---
titles = f"Прощай, {hero_name}!"
frames = "=" * 20

print(frames)
print(" " + titles + " ")
print(frames)